// 4. Лодка за риболов

// Тони и приятели много обичали да ходят за риба, те са толкова запалени по риболова, че решават да отидат на риболов с кораб. Цената за наемане на кораба зависи от сезона и броя рибари.

// Цената зависи от сезона:

// · Цената за наем на кораба през пролетта е 3000 лв.

// · Цената за наем на кораба през夏天 и есента е 4200 лв.

// · Цената за наем на кораба през зимата е 2600 лв.

// В зависимост от броя си групата ползва отстъпка:

// · Ако групата е до 6 човека включително – отстъпка от 10%.

// · Ако групата е от 7 до 11 човека включително – отстъпка от 15%.

// · Ако групата е от 12 нагоре – отстъпка от 25%.

// Рибарите ползват допълнително 5% отстъпка ако са четен брой освен ако не е есен - тогава нямат допълнителна отстъпка.

// Напишете функция, която да пресмята дали рибарите ще съберат достатъчно пари.

// Вход

// Приемат се 3 аргумента:

// · Бюджет на групата – цяло число в интервала [1…8000]

// · Сезон – текст : "Spring", "Summer", "Autumn", "Winter"

// · Брой рибари – цяло число в интервала [4…18]

// Изход

// Да се отпечата на конзолата един ред:

// · Ако бюджетът е достатъчен:

// "Yes! You have {останалите пари} leva left."

// · Ако бюджетът НЕ Е достатъчен:

// "Not enough money! You need {сумата, която не достига} leva."

// Сумите трябва да са форматирани с точност до два знака след десетичната запетая.

function fishingBoat(budget, season, fishermen) {
    let boatPrice = 0;
    
   
    switch (season) {
        case "Spring":
            boatPrice = 3000;
            break;
        case "Summer":
        case "Autumn":
            boatPrice = 4200;
            break;
        case "Winter":
            boatPrice = 2600;
            break;
    }
 
    if (fishermen <= 6) {
        boatPrice *= 0.9; 
    } else if (fishermen <= 11) {
        boatPrice *= 0.85; 
    } else {
        boatPrice *= 0.75; 
    }
    
    
    if (fishermen % 2 === 0 && season !== "Autumn") {
        boatPrice *= 0.95; 
    }
    
    
    let difference = budget - boatPrice;
    
    if (difference >= 0) {
        return `Yes! You have ${difference.toFixed(2)} leva left.`;
    } else {
        return `Not enough money! You need ${Math.abs(difference).toFixed(2)} leva.`;
    }
}

// Примери за тестване:
console.log(fishingBoat(3000, "Summer", 11));
console.log(fishingBoat(3600, "Autumn", 6));